VladimirKambovski/Pomodoro-Timer--STM32/Pomodoro_0/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "libjpeg.h"
#include "app_touchgfx.h"
#include "FreeRTOS.h"
#include "queue.h"
#include <stdbool.h>


/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32h750b_discovery_qspi.h"
#include "stm32h750b_discovery_sdram.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/






CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

JPEG_HandleTypeDef hjpeg;
MDMA_HandleTypeDef hmdma_jpeg_infifo_th;
MDMA_HandleTypeDef hmdma_jpeg_outfifo_th;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

SDRAM_HandleTypeDef hsdram2;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for GUITask */
osThreadId_t GUITaskHandle;
const osThreadAttr_t GUITask_attributes = {
  .name = "GUITask",
  .stack_size = 8192 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */
QueueHandle_t xCommandQueue = NULL; // Define the queue here
QueueHandle_t xTimeQueue = NULL;






void vUITask(void *pvParameters) {
  for (;;) {
    // No direct UI calls here! Use queues only.
    vTaskDelay(pdMS_TO_TICKS(50)); // Prevent task starvation
  }
}

void vTimerTask(void *pvParameters) {
  TimerCommand_t command;
  TimeUpdate_t timeUpdate;
  bool isRunning = false; // Added: Track if timer is running

  for (;;) {
    if (xQueueReceive(xCommandQueue, &command, portMAX_DELAY) == pdPASS) {
      if (command.commandType == START_TIMER) {
        // ====== CHANGED: Added isRunning flag ======
        isRunning = true;

        int16_t studyTime = command.studyTime;
        int16_t totalSessions = command.sessions;
        int16_t breakTime = (studyTime > 10) ? (studyTime / 20) : 1;
        int16_t currentSession = 1;




        // ====== CHANGED: Added isRunning check ======
        while (isRunning && (currentSession <= totalSessions)) {
        	 bool isBreak = false;
        	        int16_t currentMinute = studyTime;
        	        int16_t currentSecond = 0;


          // Study session countdown
        	TickType_t xLastWakeTime = xTaskGetTickCount();
          while (isRunning && (currentMinute > 0 || currentSecond > 0)) {

            vTaskDelayUntil(&xLastWakeTime, pdMS_TO_TICKS(1000));

            // ====== CHANGED: Check for STOP command during countdown ======
            if (xQueueReceive(xCommandQueue, &command, 0) == pdPASS) {
              if (command.commandType == STOP_TIMER) {
                isRunning = false;
                break; // Exit inner loop
              }
            }

            // Decrement time
            if (currentSecond == 0) {
              currentMinute--;
              currentSecond = 59;
            } else {
              currentSecond--;
            }

            // Send update to UI
            timeUpdate.minutes = currentMinute;
            timeUpdate.seconds = currentSecond;
            timeUpdate.isBreak = isBreak;
            xQueueSend(xTimeQueue, &timeUpdate, portMAX_DELAY);
          }

          if (!isRunning) break; // Exit session loop if stopped

          // Break session (if not last session)
          if (currentSession < totalSessions) {
            isBreak = true;
            currentMinute = breakTime;
            currentSecond = 0;
            TickType_t xLastWakeTime = xTaskGetTickCount();
            while (isRunning && (currentMinute > 0 || currentSecond > 0)) {\

              vTaskDelayUntil(&xLastWakeTime, pdMS_TO_TICKS(1000));

              // ====== CHANGED: Check for STOP command during break ======
              if (xQueueReceive(xCommandQueue, &command, 0) == pdPASS) {
                if (command.commandType == STOP_TIMER) {
                  isRunning = false;
                  break;
                }
              }

              if (currentSecond == 0) {
                currentMinute--;
                currentSecond = 59;
              } else {
                currentSecond--;
              }

              timeUpdate.minutes = currentMinute;
              timeUpdate.seconds = currentSecond;
              timeUpdate.isBreak = isBreak;
              xQueueSend(xTimeQueue, &timeUpdate, portMAX_DELAY);
            }
          }

          if (!isRunning) break; // Exit session loop if stopped
          currentSession++;
          isBreak = false;
        }
      }
      // ====== CHANGED: Handle STOP_TIMER command ======
      else if (command.commandType == STOP_TIMER) {
        isRunning = false;
        xQueueReset(xTimeQueue);	// Clear any pending time updates
      }
    }
  }
}

/* USER CODE END PV */

